Revit 2024 API
IndexBuffer.GetIndexStreamLine Method
 Gets a stream that can be used to write IndexLine segment primitives into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IndexStreamLine GetIndexStreamLine()
Visual Basic
Public Function GetIndexStreamLine As IndexStreamLine
Visual C++
public:
IndexStreamLine^ GetIndexStreamLine()
Return Value
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
IndexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace